[
  {
    "image": "../images/f1.webp",
    "title": "Beginner's Guide to F1 Terms",
    "subtitle": "Frontend Development with HTML & CSS",
    "text": "A dive into the thrilling world of Formula 1 racing. As a front-end developer on this project, I worked primarily with HTML and CSS to modernize a previously used template. Collaborating closely with designers, the project focused on a visually pleasing and user-friendly design, clarifying and defining popular F1 terms. By utilizing HTML for structured content presentation and CSS for stylistic enhancements, we ensured an engaging and seamless user experience for anyone new to F1 racing.",
    "link": "https://www.espn.com/espn/feature/story/_/id/36180474/f1-terms-explained",
    "linktext": "Explore F1 Terms Guide"
  },
 
  {
    "image": "../images/hinchliffe.webp",
    "title": "Rebirth of Hinchliffe Stadium",
    "subtitle": "Contributing Development & QA",
    "text": "An chronicle of Hinchliffe Stadium's rebirth, a project where I served as a contributing developer. Complying with design specifications, I built various modules that played a crucial role in the site design, contributing to the overall visual storytelling of the stadium's reconstruction and its complicated history. In addition to this, my role included supporting the project quality assurance, ensuring the functionality and responsiveness of the developed modules, thereby enhancing the user interaction and overall experience of the site.",
    "link": "https://andscape.com/features/hinchliffe-stadium-paterson-new-jersey-reconstruction-complicated-history",
    "linktext": "Discover the Hinchliffe Stadium Story"
  },
  {
    "image": "../images/video-scrub.webp",
    "title": "Scroll-Based Video Scrubber",
    "subtitle": "Sync Playback with HTML, CSS & JS",
    "text": "Discover a unique way to interact with videos using this scroll-based scrubber. This CodePen project leverages HTML, CSS, and JavaScript to link a video tag object with the user's scroll position, creating an immersive experience.",
    "link": "https://codepen.io/garrettsiegel/pen/LYJwmvj",
    "linktext": "Experience Scroll-Controlled Playback"
  },
  
  {
    "image": "../images/menu-app.png",
    "title": "Interactive Restaurant Menu Manager",
    "subtitle": "React, Firebase & Cloud Firestore Powered Solution",
    "text": "Introducing a cutting-edge, interactive restaurant menu manager that simplifies the process of adding and deleting menu items. This single-page application, developed with React and React Bootstrap, leverages the power of Cloud Firestore's realtime database and Firebase's back-end service for seamless data synchronization. The intuitive CRUD interface, responsive design, and smooth navigation create an unparalleled user experience. Custom React hooks and effective state management make this app an essential tool for modern restaurant owners and managers.",
    "link": "https://garrettsiegel.github.io/react-firebase-restaurant-menu-directory",
    "linktext": "Explore the Menu Manager Now"
  },
  {
    "image": "../images/sneaker-smarter-site.webp",
    "title": "Sneaker Smarter Lead Capture",
    "subtitle": "HTML, CSS & PHP Integration",
    "text": "A custom lead capture page for Sneaker Smarter, a weekly sneaker news site. This project involved updating the design with provided assets, creating a responsive layout using HTML, CSS, and PHP, and embedding essential functions.",
    "link": "https://sneakersmarter.com",
    "linktext": "View Capture Page"
  },
  {
    "image": "../images/list-pagination.webp",
    "title": "Dynamic List Pagination & Filtering",
    "subtitle": "Enhancing UX with JS, HTML, & CSS",
    "text": "Explore a project that leverages JavaScript and progressive enhancement to transform a default list of 54 students into a dynamic, paginated list. Displaying 10 students per page, the solution incorporates navigation buttons, enabling users to easily browse through the list in a user-friendly manner.",
    "link": "https://codepen.io/garrettsiegel/pen/xBPZyy",
    "linktext": "View Dynamic Pagination Project"
  },
  {
    "image": "../images/ftechfolk-site.webp",
    "title": "FinTech Business Website Design",
    "subtitle": "Branding & Development with HTML, CSS & JS",
    "text": "Discover a small yet impactful website designed for a European financial tech company. This project entailed crafting the company's logo and site identity while also handling the site's coding, using HTML, CSS, and JavaScript to create a visually appealing and functional online presence.",
    "link": "https://garrettsiegel.github.io/Ftechfolks",
    "linktext": "See FinTech Website Design"
  },
  {
    "image": "../images/interactive-form.webp",
    "title": "Advanced Interactive Registration Form",
    "subtitle": "JS, jQuery, HTML & CSS Integration",
    "text": "A project featuring an enhanced interactive registration form using Vanilla JavaScript and jQuery. With a focus on user experience, tasks included setting input field focus, creating unobtrusive fields, managing checkbox conditions, calculating item totals, displaying appropriate payment sections, and implementing form validation with error messages. The solution also supports real-time validation and works without JavaScript.",
    "link": "https://codepen.io/garrettsiegel/pen/wOPMqa",
    "linktext": "Experience the Advanced Form"
  },
  {
    "image": "../images/arbitral-site.webp",
    "title": "News App Landing Page",
    "subtitle": "HTML, CSS & Figma Design",
    "text": "Explore a captivating landing page for a news-based social media app. With only the logo and app screenshots provided, this project highlights skillful use of HTML, CSS, and Figma in design and prototyping, delivering an appealing user experience.",
    "link": "https://garrettsiegel.github.io/arbitral",
    "linktext": "See Landing Page"
  }
]
